
## Plan Result (koyashi.ro)

[CI link](https://github.com/koyashiro/infra/actions/runs/8809118454)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.cname_root


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "koyashiro.pages.dev"
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":179,"Program":"tfcmt","SHA1":"d172bd9e7856e94d9899380b2c106333d77f67b2","Target":"koyashi.ro","Vars":{},"WorkflowName":"terraform"} -->